PlayingCard (карта) е класа со која се репрезентира карта во игри со карти
како покер и блек џек. Во неа се чува информација за бојата (херц, каро, пик,
треф) и рангот (вредност од 2 до 10 или џандар, кралица, поп или ас). Deck
(шпил од карти) е класа која репрезентира комплет од 52 карти. Додека
MultipleDeck (повеќе шпилови) е класа која репрезентира повеќе шпилови со
карти (точниот број се задава во конструкторот). Да се имплментираат 3 класи
PlayingCard, Deck, и MultipleDeck, со стандардна функционалност за карта, за
шпил и повеќе шпилови. Да се имплментираат методи за мешање shuffle,
делење на карта dealCard и проверка дали има останато карти.
